a, b = input(), input()
if (a == "камень" and b == "бумага") or (a == "бумага" and b == "ножницы") or (a == "ножницы" and b == "камень") \
        or (a == "камень" and b == "пират") or (a == "ножницы" and b == "пират") or (a == "бумага" and b == "ром") \
        or (a == "пират" and b == "ром") or (a == "пират" and b == "бумага") or (a == "ром" and b == "ножницы") \
        or (a == "ром" and b == "камень"):
    print("второй")
elif (b == "камень" and a == "бумага") or (b == "бумага" and a == "ножницы") or (b == "ножницы" and a == "камень") \
        or (b == "камень" and a == "пират") or (b == "ножницы" and a == "пират") or (b == "бумага" and a == "ром") \
        or (b == "пират" and a == "ром") or (b == "пират" and a == "бумага") or (b == "ром" and a == "ножницы") \
        or (b == "ром" and a == "камень"):
    print("первый")
else:
    print("ничья")
    